tap 'homebrew/services'
tap 'thoughtbot/formulae'
tap 'samandmoore/git-up', 'https://github.com/samandmoore/git-up'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'coreutils'
brew 'ctags'
brew 'duti'
brew 'eza'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-up'
brew 'lazygit'
brew 'neovim'
brew 'mise'
brew 'rcm'
brew 'ripgrep'
brew 'starship'
brew 'tmux'
brew 'zoxide'

# mobile dev things
tap 'robotsandpencils/made'
brew 'xcodes'

tap 'homebrew/cask'
cask_args appdir: '/Applications'
cask '1password'
cask 'alacritty'
cask 'arc'
cask 'ghostty'
cask 'kitty'
cask 'licecap'
cask 'raycast'
cask 'visual-studio-code'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-jetbrains-mono'
cask 'font-source-code-pro'
cask 'font-intel-one-mono'
cask 'font-intone-mono-nerd-font'
cask 'font-caskaydia-mono-nerd-font'

mas 'HazeOver • Distraction Dimmer™', id: 430798174
mas 'Things 3', id: 904280696
