tap 'thoughtbot/formulae'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'btop'
brew 'colima'
brew 'coreutils'
brew 'duti'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'eza'
brew 'fd'
brew 'fish'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnu-sed'
brew 'gum'
brew 'jj'
brew 'jq'
brew 'lazydocker'
brew 'lazygit'
brew 'libyaml'
brew 'm-cli'
brew 'mise'
brew 'neovim'
brew 'rcm'
brew 'ripgrep'
brew 'rumdl'
brew 'starship'
brew 'tldr'
brew 'tree-sitter-cli'
brew 'zoxide'

# mobile dev things
tap 'xcodesorg/made'
brew 'xcodes'

cask_args appdir: '/Applications'
cask '1password'
cask '1password-cli@beta'
cask 'alacritty'
cask 'firefox'
cask 'hammerspoon'
cask 'handy'
cask 'helium-browser'
cask 'kitty'
cask 'licecap'
cask 'raycast'
cask 'visual-studio-code'
cask 'obsidian'

# fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-jetbrains-mono'
cask 'font-source-code-pro'
cask 'font-intel-one-mono'
cask 'font-intone-mono-nerd-font'
cask 'font-caskaydia-mono-nerd-font'

mas 'HazeOver • Distraction Dimmer™', id: 430798174
mas 'Things 3', id: 904280696
