tap 'thoughtbot/formulae'
tap 'samandmoore/git-up', 'https://github.com/samandmoore/git-up'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'btop'
brew 'coreutils'
brew 'duti'
brew 'docker'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-up'
brew 'gnu-sed'
brew 'gum'
brew 'lazydocker'
brew 'lazygit'
brew 'libffi'
brew 'libyaml'
brew 'm-cli'
brew 'mise'
brew 'neovim'
brew 'rcm'
brew 'ripgrep'
brew 'spotify_player'
brew 'starship'
brew 'zoxide'

# mobile dev things
tap 'robotsandpencils/made'
brew 'xcodes'

cask_args appdir: '/Applications'
cask '1password'
cask 'alacritty'
cask 'arc'
cask 'firefox'
cask 'kitty'
cask 'licecap'
cask 'raycast'
cask 'visual-studio-code'
cask 'obsidian'

# fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-jetbrains-mono'
cask 'font-source-code-pro'
cask 'font-intel-one-mono'
cask 'font-intone-mono-nerd-font'
cask 'font-caskaydia-mono-nerd-font'

mas 'HazeOver • Distraction Dimmer™', id: 430798174
mas 'Things 3', id: 904280696
