tap 'homebrew/core'
tap 'homebrew/services'
tap 'heroku/brew'
tap 'thoughtbot/formulae'
brew 'autojump'
brew 'bash'
brew 'bash-completion'
brew 'ccat'
brew 'comby'
brew 'coreutils'
brew 'ctags'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'heroku'
brew 'hub'
brew 'macvim'
brew 'nodenv'
brew 'rbenv'
brew 'rcm'
brew 'ripgrep'
brew 'tmux'
brew 'tree'

# mobile dev things
tap 'leoafarias/fvm'
tap 'robotsandpencils/made'
brew 'fvm'
brew 'xcodes'

tap 'homebrew/cask'
cask_args appdir: '/Applications'
cask '1password'
cask 'alfred'
cask 'divvy'
# cask 'docker'
cask 'iterm2'
cask 'licecap'
cask 'signal'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'microsoft-edge'
cask 'meetingbar'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-jetbrains-mono'
cask 'font-source-code-pro'
