tap 'homebrew/core'
tap 'homebrew/services'
tap 'thoughtbot/formulae'
brew 'macvim', args: ['with-cscope', 'with-lua', 'with-features=huge', 'with-luajit', 'with-override-system-vim']
brew 'ripgrep'
brew 'tmux'
brew 'ctags'
brew 'coreutils'
brew 'tree'
brew 'autojump'
brew 'hub'
brew 'bash'
brew 'rcm'
brew 'fzf'
brew 'git'
brew 'ccat'

tap 'caskroom/cask'
cask_args appdir: '/Applications'
cask 'alfred'
cask 'iterm2'
cask 'google-chrome'
cask 'nvalt'
cask 'whatsapp'
cask 'signal'
cask '1password'
cask 'divvy'
cask 'dash'
cask 'LaunchControl'
cask 'dropbox'
cask 'keybase'
cask 'docker'
cask 'visual-studio-code'

tap 'caskroom/fonts'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-source-code-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
